/*
1. Ведомость учёта
Что нужно сделать
Вы уже создавали программу чтения и записи ведомости. Теперь её нужно 
обобщить и дополнить использованием структур.

Формат ведомости прежний:
сначала - имя и фамилия получателя денег,
далее - дата выдачи в формате ДД.ММ.ГГГГ,
затем - сумма выплаты в рублях. 
Данные разделяются пробелами. В конце 
каждой записи должен быть перевод строки. Структура данных должна 
соответствовать этому формату.
При старте программы пользователь отправляет команду: list или add. 
Команда list осуществляет чтение из файла ведомости, как и прежде, только 
уже в структуры данных, и отображает их на экране. Команда add добавляет 
новую запись в конец ведомости.
*/