/*
Задание 2. Регистратура
Что нужно сделать
Напишите программу «Регистратура». На вход программе приходят строки с
фамилиями или строка Next. Пришедшие люди становятся в очередь, а по запросу
Next необходимо вызвать в регистратуру человека с фамилией, идущей первой в
__лексикографическом порядке__ (по алфавиту), и вывести его фамилию на экран.
Фамилии пациентов могут повторяться. Каждый запрос (на добавление и вывод)
должен работать за O(logn).
*/

#include <iostream>
#include <string>
#include <map>

void nextPatient()
{
}

void appendQueue()
{
}

int main()
{
    std::string command;

    return 0;
}