/*
Задание 3. Реализация симуляции игры «Рыбалка»

Что нужно сделать
Реализуйте простую симуляцию игры в рыбалку. В исходном текстовом файле реки 
(river.txt) задаётся список из видов рыб, которые можно в ней поймать. Рыбок 
может быть сколько угодно, разных видов. Виды при этом могут повторяться. В 
начале программы пользователь указывает, какую именно рыбу он сейчас будет 
ловить — вид этой рыбы. После этого из первого файла друг за другом 
осуществляется чтение его содержимого, вид за видом. Если на отдельных шагах 
вид совпал с указанным пользователем, в выходной файл basket.txt (корзинка) 
записывается этот вид. В конце программы показывается, сколько было поймано рыб 
за текущую ловлю. Программу можно запускать несколько раз, при этом уже 
пойманные рыбы должны сохраняться в файле-корзинке.
*/

#include <iostream>
#include <fstream>
#include <cstdlib>
#include <ctime>

int main()
{
    std::ifstream river("/large/data2/Home/Andrew/Documents/geekbrains/CPP_advanced/lesson002/task03/river.txt");
    std::ofstream("/large/data2/Home/Andrew/Documents/geekbrains/CPP_advanced/lesson002/task03/basket.txt", std::ios::app);

    return 0;
}